#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_availability_zones.available: Reading...
data.aws_ami.ubuntu: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
data.aws_ami.ubuntu: Read complete after 0s [id=ami-0c1c30571d2dae5c9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_instance.jbe_database will be created
  + resource "aws_db_instance" "jbe_database" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "jbe_db"
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "16.1"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "jbe-database"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Name"          = "jbe_database"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + tags_all                              = {
          + "Name"          = "jbe_database"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + timezone                              = (known after apply)
      + username                              = (sensitive value)
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_subnet_group.jbe_db_subnet_group will be created
  + resource "aws_db_subnet_group" "jbe_db_subnet_group" {
      + arn                     = (known after apply)
      + description             = "DB subnet group for JBE"
      + id                      = (known after apply)
      + name                    = "jbe_db_subnet_group"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name"          = "jbe_db_sng"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + tags_all                = {
          + "Name"          = "jbe_db_sng"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_eip.jbe_web_eip[0] will be created
  + resource "aws_eip" "jbe_web_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"          = "jbe_web_eip_0"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + tags_all             = {
          + "Name"          = "jbe_web_eip_0"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + vpc                  = (known after apply)
    }

  # aws_instance.jbe_web[0] will be created
  + resource "aws_instance" "jbe_web" {
      + ami                                  = "ami-0c1c30571d2dae5c9"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "jbe_kp"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"          = "jbe_web"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + tags_all                             = {
          + "Name"          = "jbe_web"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "cc5c85cadd0446c04c96a4fc3decd287f2a8f474"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_internet_gateway.jbe_igw will be created
  + resource "aws_internet_gateway" "jbe_igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"          = "jbe_igw"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + tags_all = {
          + "Name"          = "jbe_igw"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + vpc_id   = (known after apply)
    }

  # aws_key_pair.jbe_kp will be created
  + resource "aws_key_pair" "jbe_kp" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "jbe_kp"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (sensitive value)
      + tags            = {
          + "created-using" = "terraform"
          + "name"          = "jbe_kp"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + tags_all        = {
          + "created-using" = "terraform"
          + "name"          = "jbe_kp"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
    }

  # aws_route_table.jbe_private_rt will be created
  + resource "aws_route_table" "jbe_private_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"          = "jbe_private_rt"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + tags_all         = {
          + "Name"          = "jbe_private_rt"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.jbe_public_rt will be created
  + resource "aws_route_table" "jbe_public_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name"          = "jbe_public_rt"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + tags_all         = {
          + "Name"          = "jbe_public_rt"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.jbe_db_sg will be created
  + resource "aws_security_group" "jbe_db_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for JBE database"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow PostgreSQL traffic from only the web sg"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = "jbe_db_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"          = "jbe_db_sg"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + tags_all               = {
          + "Name"          = "jbe_db_sg"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.jbe_web_sg will be created
  + resource "aws_security_group" "jbe_web_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for JBE web server"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow SSH from my computer"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all traffic through HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "jbe_web_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"          = "jbe_web_sg"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + tags_all               = {
          + "Name"          = "jbe_web_sg"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.jbe_private_subnet[0] will be created
  + resource "aws_subnet" "jbe_private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"          = "jbe_private_subnet_0"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + tags_all                                       = {
          + "Name"          = "jbe_private_subnet_0"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.jbe_private_subnet[1] will be created
  + resource "aws_subnet" "jbe_private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"          = "jbe_private_subnet_1"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + tags_all                                       = {
          + "Name"          = "jbe_private_subnet_1"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.jbe_public_subnet[0] will be created
  + resource "aws_subnet" "jbe_public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"          = "jbe_public_subnet_0"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + tags_all                                       = {
          + "Name"          = "jbe_public_subnet_0"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.jbe_vpc will be created
  + resource "aws_vpc" "jbe_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"          = "jbe_vpc"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
      + tags_all                             = {
          + "Name"          = "jbe_vpc"
          + "created-using" = "terraform"
          + "owner"         = "thashil.naidoo@bbd.co.za"
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + database_endpoint = (known after apply)
  + database_port     = (known after apply)
  + web_public_dns    = (known after apply)
  + web_public_ip     = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ThashilBBD, Action: `pull_request`*